src/Catalogs/Склады/Склады.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Склады</name>
  <comment>(Общ)</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦенРозничнойТорговли</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ТипыЦенНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <comment>(Упр)</comment>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСклада</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ВидыСкладов</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСекции</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасчетРозничныхЦенПоТорговойНаценке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеВестиУчетПоСериям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Расстояния</name>
    <attributes>
      <name>НомерВорот</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерРяда</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Расстояние</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтратегияОбхода</name>
    <comment>Стратегия обхода склада</comment>
    <attributes>
      <name>НомерВорот</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОперацияОбхода</name>
      <type>
        <types>EnumRef.ВидыОперацийОбходаСклада</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерМаршрута</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерРяда</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЯчейкаСтарт</name>
      <type>
        <types>CatalogRef.СкладскиеЯчейки</types>
      </type>
    </attributes>
    <attributes>
      <name>ЯчейкаФиниш</name>
      <type>
        <types>CatalogRef.СкладскиеЯчейки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШиринаПроходов</name>
    <attributes>
      <name>Проход</name>
      <comment>Номер прохода</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерРяда</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерСледующегоРяда</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Расстояние</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Enums/ВидыСкладов/ВидыСкладов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСкладов</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>Оптовый</name>
    <comment>(Общ) Оптовый склад</comment>
  </enumValues>
  <enumValues>
    <name>Розничный</name>
    <comment>(Общ) Розничный</comment>
  </enumValues>
  <enumValues>
    <name>НТТ</name>
    <comment>(Общ) Неавтоматизированная торговая точка</comment>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Склады/Forms/ФормаЭлементаУправляемая/Module.bsl
&НаКлиенте
Процедура УстановитьДоступность()
	
	РозницаНТТ = ПроверитьВидСклада();
	Элементы.ТипЦенРозничнойТорговли.АвтоОтметкаНезаполненного = РозницаНТТ;

	Если Не РозницаНТТ Тогда
		Элементы.ТипЦенРозничнойТорговли.ОтметкаНезаполненного = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПроверитьВидСклада()
	Если Объект.ВидСклада = Перечисления.ВидыСкладов.Розничный ИЛИ Объект.ВидСклада = Перечисления.ВидыСкладов.НТТ Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ВидСкладаПриИзменении(Элемент)
	УстановитьДоступность();
КонецПроцедуры
